<?php

    $link = mysqli_connect('localhost', 'root', 'asdfghjkl', 'database_1');
        // 接続状況をチェックします
    if (mysqli_connect_errno()) {
        die("データベースに接続できません:" . mysqli_connect_error() . "\n");
    } else {
        echo "データベースの接続に成功しました。<br>\n";
    }

    

function db_read(){ 
        try {
            $db = new PDO('mysql:host=localhost;dbname=database_1','root','asdfghjkl');
            $db->setAttribute(PDO::ATTR_ERRMODE, PDO::ERRMODE_EXCEPTION);
            $prin = $db->query("SELECT * from niigatattc");
            while($x = $prin->fetch()){
            print"+-----------------------------------------------------------------------------------------------</br>
            |学年：$x[year]年   氏名：$x[name]</br>+-----------------------------------------------------------------------------------------------</br>
            |改善点、反省：</br>$x[improve]</br>+-----------------------------------------------------------------------------------------------</br>
            |目標：$x[objective]</br>+-----------------------------------------------------------------------------------------------</br>
            課題内容、練習すること：</br>$x[task]</br>+-----------------------------------------------------------------------------------------------</br>
            |$x[time]</br>+-----------------------------------------------------------------------------------------------</br></br>";
            }
            }catch(PDOException $e){
                echo"データベースに接続できません：".$e->getMessage();
            }
    }

    db_read();// データベースのデータを読み取る

?>